; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v11)
             (pred_11 ?v9 ?v13)
             (pred_6 ?v5 ?v13)
             (pred_8 ?v8 ?v5 )
	     (pred_5 ?v5)
             (pred_12 ?v3)
             (pred_10 ?v9)
             (pred_2 ?v13)
             (pred_7 ?v5)
             (pred_3 ?v9)
             (pred_9 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v6 ?v12 ?v7 ?v2)
:precondition (and (pred_12 ?v6) (pred_12 ?v12) (pred_10 ?v7) (pred_2 ?v2)
          (pred_4 ?v6 ?v12) (pred_11 ?v7 ?v2)
                   (pred_6 ?v12 ?v2) (pred_5 ?v6) 
                   (pred_7 ?v12) (pred_3 ?v7))
:effect (and  (pred_9 ?v12) (not (pred_7 ?v12))))


(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_12 ?v6) (pred_12 ?v4)
               (pred_5 ?v6) (pred_4 ?v6 ?v4) (pred_9 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v6))))

(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_12 ?v6) (pred_10 ?v7) 
                  (pred_5 ?v6) (pred_8 ?v7 ?v6) (pred_1 ))
:effect (and (pred_3 ?v7)
   (not (pred_8 ?v7 ?v6)) (not (pred_1 ))))


(:action op_2
:parameters (?v6 ?v1 ?v10)
:precondition (and (pred_12 ?v6) (pred_10 ?v1) (pred_10 ?v10)
                  (pred_5 ?v6) (pred_3 ?v10) (pred_8 ?v1 ?v6))
:effect (and (pred_3 ?v1) (pred_8 ?v10 ?v6)
        (not (pred_3 ?v10)) (not (pred_8 ?v1 ?v6))))

(:action op_5
:parameters (?v6 ?v7)
:precondition (and (pred_12 ?v6) (pred_10 ?v7) 
                  (pred_5 ?v6) (pred_3 ?v7))
:effect (and (pred_1 ) (pred_8 ?v7 ?v6) (not (pred_3 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_07 obj_09 obj_11 obj_12 obj_05 obj_17 obj_01 obj_14 obj_04 obj_19 obj_08 obj_02 obj_06 obj_21 obj_18
    obj_16 obj_03
    obj_10 obj_13 obj_20
    )

    (:init
       (pred_1)

       (pred_12 obj_15)
       (pred_12 obj_07)
       (pred_12 obj_09)
       (pred_12 obj_11)
       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_18)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_20)

       (pred_4 obj_15 obj_12)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_12 obj_15)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_17)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_17 obj_01)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_05)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_17)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_04)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_04 obj_14)
       (pred_4 obj_19 obj_21)
       (pred_4 obj_19 obj_08)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_19)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_06 obj_21)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_19)
       (pred_4 obj_21 obj_06)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_18 obj_21)
       (pred_7 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_08)
       (pred_6  obj_19 obj_16)
       (pred_6  obj_11 obj_03)
       (pred_6  obj_08 obj_03)
       (pred_9 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_05)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_14)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_06)
       (pred_9 obj_21)
       (pred_9 obj_18)

       (pred_11  obj_10 obj_16)
       (pred_11  obj_13 obj_03)
       (pred_11  obj_20 obj_03)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_20 obj_18)
       (pred_5 obj_04)
    )

    (:goal (and
       (pred_8 obj_10 obj_17)
       (pred_8 obj_13 obj_12)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_3 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_06)
   goals met: 0 of 2
2. (op_1 obj_06 obj_10)
   deleted: (pred_8 obj_10 obj_06) (pred_1)
   added: (pred_3 obj_10)
   goals met: 0 of 2
3. (op_3 obj_06 obj_21)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_21)
   goals met: 0 of 2
4. (op_4 obj_21 obj_19 obj_10 obj_16)
   deleted: (pred_7 obj_19)
   added: (pred_9 obj_19)
   goals met: 0 of 2
5. (op_3 obj_21 obj_18)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_18)
   goals met: 0 of 2
6. (op_2 obj_18 obj_13 obj_10)
   deleted: (pred_3 obj_10) (pred_8 obj_13 obj_18)
   added: (pred_3 obj_13) (pred_8 obj_10 obj_18)
   goals met: 0 of 2
7. (op_4 obj_18 obj_08 obj_13 obj_03)
   deleted: (pred_7 obj_08)
   added: (pred_9 obj_08)
   goals met: 0 of 2
8. (op_3 obj_18 obj_08)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_08)
   goals met: 0 of 2
9. (op_5 obj_08 obj_13)
   deleted: (pred_3 obj_13)
   added: (pred_1) (pred_8 obj_13 obj_08)
   goals met: 0 of 2
10. (op_3 obj_08 obj_18)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_18)
   goals met: 0 of 2
11. (op_1 obj_18 obj_10)
   deleted: (pred_8 obj_10 obj_18) (pred_1)
   added: (pred_3 obj_10)
   goals met: 0 of 2
12. (op_3 obj_18 obj_08)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_08)
   goals met: 0 of 2
13. (op_3 obj_08 obj_01)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_01)
   goals met: 0 of 2
14. (op_3 obj_01 obj_17)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_17)
   goals met: 0 of 2
15. (op_5 obj_17 obj_10)
   deleted: (pred_3 obj_10)
   added: (pred_1) (pred_8 obj_10 obj_17)
   goals met: 1 of 2
16. (op_3 obj_17 obj_01)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_01)
   goals met: 1 of 2
17. (op_3 obj_01 obj_08)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_08)
   goals met: 1 of 2
18. (op_1 obj_08 obj_13)
   deleted: (pred_8 obj_13 obj_08) (pred_1)
   added: (pred_3 obj_13)
   goals met: 1 of 2
19. (op_3 obj_08 obj_01)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_01)
   goals met: 1 of 2
20. (op_3 obj_01 obj_17)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_17)
   goals met: 1 of 2
21. (op_3 obj_17 obj_05)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_05)
   goals met: 1 of 2
22. (op_3 obj_05 obj_12)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_12)
   goals met: 1 of 2
23. (op_5 obj_12 obj_13)
   deleted: (pred_3 obj_13)
   added: (pred_1) (pred_8 obj_13 obj_12)
   goals met: 2 of 2
